* Eldiet
A nutrition/diet planning tool for the Emacs geek who wants to stay/get in shape.








* Status
There is not much to see here at the moment. I just wanted to have an initial repository to be able to work on
this occasionally.

** TODO Design a database or something alike
   :LOGBOOK:
   CLOCK: [2016-06-29 Wed 18:01]--[2016-06-29 Wed 20:23] =>  2:22
   :END:
   <2016-07-15 Fri>

** TODO Design a parser for the org-based database [0/2]
   :LOGBOOK:
   CLOCK: [2016-07-10 Sun 09:36]--[2016-07-10 Sun 10:24] =>  0:48
   CLOCK: [2016-07-02 Sat 21:24]--[2016-07-02 Sat 22:54] =>  1:30
   CLOCK: [2016-07-01 Fri 21:47]--[2016-07-01 Fri 22:20] =>  0:33
   CLOCK: [2016-06-30 Thu 20:26]--[2016-06-30 Thu 22:03] =>  1:37
   :END:
   - [ ] The parser needs to return alists of the form ("Food" . '(a b c d e))
     or just a list with the con as the food name
   - [ ] Missing: The org function that parses properties
     There must be some builtin that is used for exporters and agenda functions. I need to find that,
     without this I am stuck
   - 

** TODO Design the helm interface
* Ideas
  
 - Calorie indicator in modeline (like 1454/2500)
 - Database and datastructure need to be figured out -- Maybe the database from [[http://www.gigamonkeys.com/book/practical-a-simple-database.html][this]] lisp tutorial will help
 - Major mode, minor mode, write only window? All of them?
 - Use capture to note a meal
   - Can you run a function when doing a capture, allowing you to interactively
     pick the foods you use for that meal?
   - Have a helm interface to select the food when running the capture command (looking e.g. like helm-bibtex)

 - Integration with an orgmode based shopping list
 - Integration with an orgmode based cookbook
 - Babel based analytics (e.g. inline plots with R/Python or just ascii plots with elisp)
